import React from 'react';
import { View, Text, StyleSheet } from 'react-native';

const PrivacyPolicyScreen = ({ navigation }) => {
    return (
        <View style={styles.container}>
            <Text style={styles.header}>ЗГОДА НА ОБРОБКУ ПЕРСОНАЛЬНИХ ДАНИХ</Text>

            <Text style={styles.text}>
                Проставивши відмітку на будь-якій з сторінок, я підтверджую, що надаю 
                добровільну та однозначну згоду команді Gongo (як Власника бази даних) 
                на обробку, в тому числі передачу третім особам, вказаних мною даних та 
                вчинення всіх необхідних дій, які, відповідно до Закону України "Про захист
                персональних даних" є обробкою моїх персональних даних, у відповідності до
                мети їх обробки, а саме:
            </Text>

            <Text style={styles.text}>
                З метою покращення користуванням профільного додатку Milio, та 
                використання всіх переваг долучення до інформаційного простору Gongo,
                зокрема в месенджері Instagram.
            </Text>

            <Text style={styles.text}>
                З метою відносин у сфері реклами, маркетингу та збору персональних
                даних у комерційних цілях, відносин у сфері статистики, інших відносин,
                пов'язаних з обробкою персональних даних, згідно ст. 10 Закону України
                "Про захист персональних даних" від 01.06.2010 р. №2297-VI відповідно до 
                вимог Цивільного кодексу України, Господарського кодексу України, Податкового
                кодексу України, Статуту Товариства, інших нормативно-правових актів України
                та локальних актів Власника бази персональних даних.
            </Text>

            <Text style={styles.text}>
                Отримання мною звернень (повідомлень, запитів тощо) засобами телефонного зв'язку
                (в тому числі SMS-розсилок), поштового зв'язку, електронною поштою.
            </Text>

            <Text style={styles.text}>
                Здійснення рекламної та маркетингової діяльності Власника (включаючи, але не обмежуючись,
                такими діями, як направлення інформаційних та/або рекламних повідомлень про акції чи
                спеціальні пропозиції шляхом електронної розсилки, направлення SMS або голосових повідомлень, тощо).
            </Text>
        </View>
    );
};

const styles = StyleSheet.create({
    container: {
        flex: 1,
        backgroundColor: '#D4C295',
        padding: 20,
    },
    header: {
        fontSize: 17,
        fontWeight: 'bold',
        marginBottom: 20,
        textAlign: 'left',
    },
    text: {
        fontSize: 14,
        color: '#333',
        textAlign: 'justify',
        marginBottom: 10, // Відступ між абзацами
        textIndent: 20, // Відступ для абзацу
    },
});

export default PrivacyPolicyScreen;
