import React from 'react';
import { ScrollView, Text, StyleSheet } from 'react-native';

const RulesScreen = ({ navigation }) => {
    return (
        <ScrollView style={styles.container}>
            <Text style={styles.header}>1. ОСНОВНІ ТЕРМІНИ ТА ВИЗНАЧЕННЯ</Text>
            <Text style={styles.subHeader}>1.1 Програма знижок для військових "Milio" - </Text>
            <Text style={styles.text}>
                комплексна система знижок, акцій та пропозицій, що регулює взаємовідносини
                між Організатором Програми знижок "Milio", Партнерами Програми знижок "Milio"
                та Учасниками Програми знижок "Milio", в рамках якої учасники мають можливість
                отримувати акційні/спеціальні пропозиції Партнерів програми щодо купівлі товарів/робіт/
                послуг.
            </Text>
            <Text style={styles.subHeader}>1.2 Організатор Програми знижок "Milio" - </Text>
            <Text style={styles.text}>
               особа, яка організувала Програму та володіє винятковими правами на управління
               та розвиток Програми, а також її уповноважені представники. Організатором Програми
               є cтудентська організація "Gongo".
            </Text>
            <Text style={styles.subHeader}>1.3 Учасник Програми знижок "Milio" - </Text>
            <Text style={styles.text}>
               дієздатна фізична особа, яка є резидентом України та досягла 18 років, надала 
               свою згоду на участь у програмі шляхом отримання та активації права бути Учасником 
               Програми знижок "Milio", однозначно погоджується з Правилами Програми знижок "Milio" 
               та участь якого підтверджена організатором.
            </Text>
            <Text style={styles.subHeader}>1.4 Анкета Учасника Програми знижок "Milio" - </Text>
            <Text style={styles.text}>
                реєстраційна форма у відповідному мобільному додатку "Milio",що заповнюється 
                Учасником і є підтвердженням бажання особи стати Учасником Програми, а також 
                підтвердженням згоди Учасника з Правилами Програми знижок "Milio" і згоди на 
                зберігання, обробку будь-якими способами та використання Організатором Програми 
                персональних даних Учасника, що знаходяться в Анкеті.
            </Text>
            <Text style={styles.subHeader}>1.5 Партнер  Програми знижок "Milio" - </Text>
            <Text style={styles.text}>
                суб'єкт господарювання, в т.ч. фізична особа-підприємець,яка відповідно до умов
                Програми надає Учасникам Програми пільгові/акційні/спеціальні умови на покупки 
                товарів/послуг чи інші бонуси в якості винагороди за участь в Програмі.
            </Text>
            <Text style={styles.subHeader}>1.6 Винагорода - </Text>
            <Text style={styles.text}>
                пільгові/акційні/спеціальні умови на придбання/отримання товарів/послуг/робіт,
                або інша форма бонусу Учасника Програми,Партнером за погодженням з Організатором,
                з урахуванням положень цих Правил та чинного законодавства України. Отримання 
                Винагороди в рамках Програми означає бонус/подарунок/придбання (купівлю) Учасником
                вищезазначених благ за пільговою/акційною/спеціальною ціною (зі знижкою від існуючих 
                цін,яка надається у порядку,визначеному цими Правилами) відповідно до умов та Правил
                Програми та чинного законодавства України.
            </Text>
            <Text style={styles.header}>2. ЗАГАЛЬНІ ПОЛОЖЕННЯ</Text>
            <Text style={styles.text}>2.1 Програма є договором приєднання в 
            розумінні ст. 634 Цивільного кодексу України </Text>
            <Text style={styles.text}>2.2 Програма не є азартною грою, лотереєю,
            послугою в сфері ігорного бізнесу.
              </Text>
            <Text style={styles.text}>2.3 Програма діє у всіх торгових точках 
            (осередках/представництвах) Партнерів Програми(інформація про адреси 
            Партнерів розміщена в мобільному додатку Програми знижок "Milio") </Text>
            <Text style={styles.text}>2.4 Організатор має право зупинити Програму,
            скасувати чи змінити умови Програми. </Text>
            <Text style={styles.header}>3. ПРАВИЛА УЧАСТІ ТА РЕЄСТРАЦІЇ В ПРОГРАМІ</Text>
            <Text style={styles.text}>3.1 Учасником Програми може бути тільки повнолітня фізична особа,яка 
            має при собі посвідчення Учасника Бойових Дій, згідно закону від 12.01.2023 №2864-IX, коректно 
            заповнила обов'язкові поля Анкети Учасника та погодилась з умовами Правил Програми знижок "Milio".</Text>
            <Text style={styles.text}>3.2 Заповнюючи Анкету Учасника Програми, фізична особа подає персональні
            та контактні дані для реєстрації в мобільній аплікації Програми. Заповнення та внесення  даних Анкети
            Учасника до інформаційної системи є обов'язковою умовою повноправної участі у Програмі. Кожна Анкета 
            містить обов'язкові для заповнення поля. Без введення інформації до обов'язкових для заповнення полів 
            Анкети реєстрація Учасника в Програмі неможлива.</Text>
            <Text style={styles.text}>3.2.1 Обов'язковими для заповнення є наступні поля: </Text>
            <Text style={styles.text}>- Ім'я</Text>         
            <Text style={styles.text}>- Прізвище</Text>          
            <Text style={styles.text}>- e-mail</Text>
            <Text style={styles.text}>- Пароль та його підтвердження</Text>
            <Text style={styles.text}>- Аватар </Text>
            <Text style={styles.text}>3.3 Заповнена та валідована фізичною особою Анкета засвідчує її добровільну
            згоду (дозвіл) Організаторові Програми на обробку (збирання,реєстрацію, накопичення, зберігання, 
            адаптування, зміну, поновлення, використання, поширення(розповсюдження, реалізацію , передачу), знеособлення,
            знищення тощо, у тому числі з використанням інформаційних(автоматизованих) систем) персональних даних
            фізичної особи та інших даних, які вказані у цій Анкеті, з метою персоніфікації фізичної особи, як Учасника 
            Програми, у т.ч. для участі у всіх акціях та заходах рекламного характеру, а також згоду на передачу(поширення)
            її персональних даних Партнерам Програми та третім особам (в т.ч. розпорядникам персональних даних, іноземним
            суб'єктам відносин, пов'язаних з персональними даними) з метою їхньої обробки, в тому числі для здійснення 
            персональних комунікацій з Учасником, передачі та отримання інформації. Учасник Програми може у будь-який момент
            відмовитись від отримання такої інформації, повідомивши про це Організатора через надані ним електронні канали 
            комунікацій. Шляхом заповнення та подання Анкети фізична особа засвідчує, що вона ознайомдена з цими Правилами 
            Програми, обізнана про те, що надані нею персональні дані вносяться до інформаційної системи - Бази персональних 
            даних Учасників Програми, а також підтверджує ознайомлення з правами, які згідно зі ст. 8 Закону України "Про захист
            персональних даних" та положеннями чинного законодавства надаються їй як суб'єктові персональних даних. Анкета не містить
            ідентифікаційних даних фізичної особи, зокрема номерів паспорта й ідентифікаційного коду. Заповнена та валідована фізичною
            особою Анкета засвідчує також її згоду з усіма умовами та цими правилами Програми.
            </Text>
            <Text style={styles.text}>3.4 Учасник зобов'язується надавати точні та достовірні дані при заповненні Анкети,
            а також своєчасно повідомляти Організатора про зміни, що стосуються наданих відомостей. Учасник Програми несе
            відповідальність за достовірність та актуальність даних, зазначених у Анкеті, а  також своєчасність повідомлення про їх 
            зміну. Організатор Програми не зобов'язаний здійснювати перевірку,відповідності дійсності відомостей, зазначених в Анкеті.
            </Text>
            <Text style={styles.text}>3.5 Дані Учасника,що вказані в Анкеті,є конфіденційними. Доступ до даних мають відповідальні 
            особи Організатора і сам Учасник та інші особи, в тому числі Партнери, яким було надано доступ до цих даних на правових 
            підставах. Також ці дані можуть бути надані на вимогу правоохоронних та/або інших органів відповідно до чинного законодавства.
            </Text>
            <Text style={styles.text}>3.6 Організатор зобов'язується належним чином збирати,зберігати, обробляти дані Учасників Програми
            та використовувати їх у рамках Програми та цих Правил.
            </Text>
            <Text style={styles.text}>3.7 Програма розрахована виключно для особистого використання фізичними особами - Учасниками Програми,
            права Учасника Програми не можливо передавати, продавати, отримати грошову компенсацію або відчуджувати будь-якими іншими способами.
            </Text>
            <Text style={styles.text}>3.8 Організатор Програми залишає за собою право призупинити або припинити участь у Програмі будь-якого 
            Учасника Програми без попереднього повідомлення шляхом блокування Карти Учасника у випадках, якщо Учасник:</Text>
            <Text style={styles.text}>- Порушує Правила Програми та/або інші угоди між Учасником і Організатором програми;</Text>
            <Text style={styles.text}>- Надає Організатору Програми недостовірні відомості або інформацію,що вводить в оману;</Text>         
            <Text style={styles.text}>- Здійснює шахрайські та/або недобросовісні дії. Наявність шахрайських та/або недобросовісних дій
            може бути визначена одноосібно Організатором Програми та не підлягає оскарженню.</Text>     
            <Text style={styles.header}>4. УМОВИ УЧАСТІ ПАРТНЕРІВ В ПРОГРАМІ</Text>   
            <Text style={styles.text}>4.1. Партнерами Програми є зареєстровані за законодавством України юридичні особи та фізичні 
            особи-підприємці, що провадять господарську діяльність на території України згідно чинного законодавства України.
            </Text>
            <Text style={styles.text}> 4.2. Партнери, що у відповідний, визначений цими Умовами і Правилами спосіб, підтвердили 
            свою участь в Програмі і зобовʼязались виконувати їх, повинні надавати, погоджений з Організатором пільгову/ акційну/ 
            спеціальну пропозицію - знижку/бонус/ подарунок. Зразок форма реєстрації Партнера затверджується Організатором і розміщується 
            в публічному доступі на відповідному сайті Програми.
            </Text>
            <Text style={styles.text}> 4.3. Відповідно до цих Правил для участі в Програмі Партнер повинен:
            - заповнити форму реєстрації, зазначену в п. 4.2. цих Правил і погодитись на дотримання цих Правил.
            - якщо з будь-яких причин, вищезазначені пільгові/акційні умови чи подарунки не були надані, при наступному візиті такого Учасника до
            Партнера, надати йому комплімент від Партнера додатково до вищезазначених звичних акційних умов чи подарунка.
            </Text>
            <Text style={styles.text}>4.4. Згідно до цих Правил Партнер отримує можливість: </Text>
            <Text style={styles.text}>- розміщення інформації про себе у мобільному додатку Програми у відповідній категорії Партнерів</Text>
            <Text style={styles.text}>- розміщення, відповідно до вказаної Партнером адреси, інформації про локації торгових точок Партнера на відповідній 
            мапі Партнерів у мобільному додатку Програми</Text>
            <Text style={styles.text}>- позиціонування Партнера та його бренду серед Учасників Програми,забезпечення умов 
            для формування належного сприйняття Партнера Учасниками Програми. </Text>
            <Text style={styles.text}>4.5. Організатор має право в односторонньому порядку припинити співпрацю в межах Програми, якщо: </Text>
            <Text style={styles.text}>- у випадку невиконання/ порушення Партнером умов цих Правил, після попередження Партнера щодо необхідності 
            усунути порушення, та надання Партнеру строку на усунення таких порушень - вони так і не були усунуті у вказаний строк. </Text>
            <Text style={styles.text}>- протягом одного календарного року Партнер отримає загалом 5 таких попереджень.</Text>
            <Text style={styles.text}>- у випадку постійних скарг Учасників на неякісні товари чи послуги, що надаються Партнером. </Text>
            <Text style={styles.text}>4.6. Партнер несе повну відповідальність а надані Організатору лого/бренд для позиціонування 
            в Програмі, та за перелік товарів/ робіт/ послуг і їх якість. </Text>
            <Text style={styles.header}>5. ІНШІ УМОВИ</Text>
            <Text style={styles.text}>5.1. Організатор програми на свій розсуд має право вносити будь-які зміни в діючі Правила Програми знижок "Milio"
            в будь-який час, про що повідомляє Учасників Програми про шляхом розміщення відповідної інформації на сайті Організатора. Слідкувати за змінами 
            в Правилах та Умовах Програми знижок "Milio" є обовʼязком Учасника. </Text>
            <Text style={styles.text}>5.2.рганізатор Програми не несе відповідальності за якість товарів, робіт та послуг, які реалізуються (продаються,
            надаються, виконуються) Партнерами Програми.</Text>
            <Text style={styles.text}>5.3. Для вирішення спірних питань Учасник повинен звернутись до Організатора, та надати на вимогу останнього всі 
            деталі по транзакції - дату, опис транзакції, реквізити Партнера програми. Організатор залишає за собою право дати відповідь на звернення 
            Учасника протягом 30 днів.</Text>
            <Text style={styles.text}>5.4. Програма є довготерміновою.</Text>
            <Text style={styles.text}>5.5.Власнник персональних даних:</Text>
            <Text style={styles.text}>студентьска організація "Gongo"</Text>
            <Text style={styles.text}> Місцезнаходження власника:</Text>
            <Text style={styles.text}>79019, ЛЬВІВСЬКА ОБЛ., МІСТО ЛЬВІВ </Text>
            <Text style={styles.text}>Форма надання згоди: </Text>
            <Text style={styles.text}>Анкета, що подається Власнику персональних даних з використанням аплікації Програми.</Text>
            <Text style={styles.text}>Категорії персональних даних, які обробляються:</Text>
            <Text style={styles.text}>Прізвище, імʼя, адреса електронної пошти та інші відомості про особу, що відображені в Анкеті чи надаються особою добровільно. 
            Анкета не містить ідентифікаційних даних фізичної особи, зокрема номерів паспорта й ідентифікаційного коду.
            </Text>
            <Text style={styles.text}>Мета обробки персональних даних:</Text>
            <Text style={styles.text}>Персоніфікація особи як Учасника Програми, у т. ч. для участі у всіх акціях 
            та заходах рекламного характеру.</Text>
            <Text style={styles.text}>Дії з обробки персональних даних, які в праві вчиняти Володілець персональних
            даних.</Text>
            <Text style={styles.text}>
            Збирання, реєстрація, накопичення, зберігання, адаптування, зміна, поновлення,використання, поширення, знеособлення,
            знищення тощо. В тому числі передача (поширення) персональних даних Партнерам Програми, розпорядникам 
            персональних даних, третім особам, іноземним субʼєктам відносин, повʼязаних із персональними даними, яких визначає 
            Виконавець самостійно, з метою їх обробки, в тому числі для здійснення персональних комунікацій з Учасником, передачі 
            та отримання інформації. Учасник погоджується з тим, що Власник персональних даних не зобов'язаний повідомляти Учасника 
            про здійснені ним дії з обробки персональних даних Учасника відповідно до мети та цілей їх обробки.
            Персональні дані можуть оброблятись у картотеках та/ або за допомогою інформаційно-телекомунікаційної системи.
            Повідомлення про права субʼєкта персональних даних:
            Наданням своїх персональних даних шляхом заповнення Анкети, особа, тим самим, підтверджує обізнаність про те, що надані 
            нею персональні дані вносяться до інформаційної системи - Бази персональних даних учасників Програми знижок "Milio", а також 
            підтверджує ознайомлення з правами, які згідно ст. 8 Закону України «Про захист персональних даних» та положеннями чинного законодавства
            надаються їй як субʼєктові персональних даних. Учасник зобовʼязується надавати точні та достовірні дані при заповненні Анкети, а також 
            своєчасно повідомляти Власник персональних даних про зміни, що стосуються наданих відомостей. Строк, на який надається згода (дозвіл) на
            обробку персональних даних:
            Згода (дозвіл) на обробку персональних даних надається Власник персональних даних на невизначений строк, а саме на період (строк) дії Програми
            знижок "Milio", учасником якої стає особа.
            Застереження:
            Не надання особою згоди на обробку її персональних даних на зазначених вище умовах, чи відкликання особою наданої нею згоди, унеможливлює її 
            реєстрацію та подальшу участь в Програмі знижок "Milio".
            </Text>
        </ScrollView>
    );
};

const styles = StyleSheet.create({
    container: {
        flex: 1,
        backgroundColor: '#D4C295',
        padding: 20,
    },
    header: {
        fontSize: 17,
        fontWeight: 'bold',
        marginBottom: 20,
        textAlign: 'center',
    },
    subHeader:{
        fontSize: 14,
        textAlign: 'justify',
    },
    text: {
        fontSize: 15,
        color: '#333',
        textAlign: 'left',
        marginBottom: 10, // Відступ між абзацами
        textIndent: 20, // Відступ для абзацу
    },
});

export default RulesScreen;
